Step-1: Write the summary about Dataset

step-2: Write each Columns discription


step-3: Write any additional information about dataset

In [1]:
import pandas as pd
import numpy as np

In [2]:
patients = pd.read_csv("patients.csv")
adverse_reactions = pd.read_csv("adverse_reactions.csv")
treatments_cut = pd.read_csv("treatments_cut.csv")
treatments= pd.read_csv("treatments.csv")

In [3]:
patients.head(3)

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,contact,birthdate,weight,height,bmi
0,1,female,Zoe,Wellish,576 Brown Bear Drive,Rancho California,California,92390.0,United States,951-719-9170ZoeWellish@superrito.com,7/10/1976,121.7,66,19.6
1,2,female,Pamela,Hill,2370 University Hill Road,Armstrong,Illinois,61812.0,United States,PamelaSHill@cuvox.de+1 (217) 569-3204,4/3/1967,118.8,66,19.2
2,3,male,Jae,Debord,1493 Poling Farm Road,York,Nebraska,68467.0,United States,402-363-6804JaeMDebord@gustr.com,2/19/1980,177.8,71,24.8

In [4]:
treatments.head(3)

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
0,veronika,jindrová,41u - 48u,-,7.63,7.20,NaN
1,elliot,richardson,-,40u - 45u,7.56,7.09,0.97
2,yukitaka,takenaka,-,39u - 36u,7.68,7.25,NaN

In [5]:
treatments_cut.head(3)

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
0,jožka,resanovič,22u - 30u,-,7.56,7.22,0.34
1,inunnguaq,heilmann,57u - 67u,-,7.85,7.45,NaN
2,alwin,svensson,36u - 39u,-,7.78,7.34,NaN

In [6]:
adverse_reactions.head(3)

  given_name     surname           adverse_reaction
0      berta  napolitani  injection site discomfort
1       lena        baer               hypoglycemia
2     joseph         day               hypoglycemia

Types of Assessment


There are 2 types of assessment styles

  • Manual - Looking through the data manually in google sheets


  • Programmatic - By using pandas functions such as info(), describe() or sample()


Steps in Assessment:


There are 2 steps involved in Assessment

  • Discover

In [7]:
# Export Data for manual assessment:
with pd.ExcelWriter("clinical_trials.xlsx")as writer:
    patients.to_excel(writer, sheet_name="patients")
    treatments.to_excel(writer, sheet_name="treatments")
    treatments_cut.to_excel(writer, sheet_name="treatments_cut")
    adverse_reactions.to_excel(writer, sheet_name="adverse_reactions")

  • Manual 

ISSUE FIND WITH DATASET:

1.  Dirty data:

Table : "Patient"

      -patients_id: 9 has misspelled name "David" insted "Devid"
      -State name some time full name and some time short name
      -Zip code are 4 digits insted of 5 digits

Table : "Treatment" & "Treatment_cut"

      -given_name and surname col is in all lower case
      -remove u from Auralin and Novodra cols
      -(-) in Auralin and Novodra cols treated as Nan
      -missing values in hba1c_change

Table : "Adverse_reaction"

      -given_name and surname col is in all lower case

2.  Messy Data:   

Table : "Patient"

      -contact col has both contach number and email

Table : "Treatment" & "Treatment_cut"

      -Auralin and Novodra col should be spit into 2 cols star and end dose 

Table : "Adverse_reaction"

      -This table shuld not be exist

Automatic Assessment

    • head and tail
    • sample
    • info
    • isnull
    • duplicated
    • describe

In [10]:
patients.sample(5)

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,contact,birthdate,weight,height,bmi
232,233,female,Kyouko,Ono,435 Pike Street,San Diego,CA,92123.0,United States,KyoukoOno@superrito.com1 858 587 9945,11/19/1940,126.9,59,25.6
393,394,male,Steven,Roy,2816 Ashford Drive,Reston,VA,22070.0,United States,StevenBRoy@rhyta.com1 703 716 8652,9/19/1975,162.4,72,22.0
435,436,female,Ivana,Kašná,3343 Jefferson Street,Newport News,VA,23601.0,United States,IvanaKasna@teleworm.us+1 (757) 736-7026,8/15/1995,173.8,67,27.2
432,433,female,Karen,Jakobsen,1690 Fannie Street,Houston,TX,77020.0,United States,KarenJakobsen@jourrapide.com1 979 203 0438,11/25/1962,185.2,67,29.0
419,420,female,Maret,Sultygov,2127 Elk City Road,Indianapolis,IN,46268.0,United States,317-956-6166MaretSultygov@teleworm.us,10/20/1969,126.1,63,22.3

In [13]:
print(f"Patient Table:\n{patients.info()}")

<class 'pandas.DataFrame'>
RangeIndex: 503 entries, 0 to 502
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   patient_id    503 non-null    int64
 1   assigned_sex  503 non-null    str
 2   given_name    503 non-null    str
 3   surname       503 non-null    str
 4   address       491 non-null    str
 5   city          491 non-null    str
 6   state         491 non-null    str
 7   zip_code      491 non-null    float64
 8   country       491 non-null    str
 9   contact       491 non-null    str
 10  birthdate     503 non-null    str
 11  weight        503 non-null    float64
 12  height        503 non-null    int64
 13  bmi           503 non-null    float64
dtypes: float64(3), int64(2), str(9)
memory usage: 55.1 KB
Patient Table:
None

In [14]:
print(f"Treatment Table:\n{treatments.info()}")

<class 'pandas.DataFrame'>
RangeIndex: 280 entries, 0 to 279
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   given_name    280 non-null    str
 1   surname       280 non-null    str
 2   auralin       280 non-null    str
 3   novodra       280 non-null    str
 4   hba1c_start   280 non-null    float64
 5   hba1c_end     280 non-null    float64
 6   hba1c_change  171 non-null    float64
dtypes: float64(3), str(4)
memory usage: 15.4 KB
Treatment Table:
None

In [15]:
print(f"Treatment_cut Table:\n{treatments_cut.info()}")

<class 'pandas.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   given_name    70 non-null     str
 1   surname       70 non-null     str
 2   auralin       70 non-null     str
 3   novodra       70 non-null     str
 4   hba1c_start   70 non-null     float64
 5   hba1c_end     70 non-null     float64
 6   hba1c_change  42 non-null     float64
dtypes: float64(3), str(4)
memory usage: 4.0 KB
Treatment_cut Table:
None

In [16]:
print(f"Adverse_reaction Table:\n{adverse_reactions.info()}")

<class 'pandas.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   given_name        34 non-null     str
 1   surname           34 non-null     str
 2   adverse_reaction  34 non-null     str
dtypes: str(3)
memory usage: 948.0 bytes
Adverse_reaction Table:
None